In [14]:
import pandas as pd
import numpy as np

In [15]:
data = pd.read_csv("bali_tourist.csv")
data

,year,area,country,January,February,March,April,May,June,July,August,September,October,November,December
0,2019,ASIA PACIFIC,AUSTRALIAN,95536,67474,83002,90265.0,98625,110815,123293,118556,124416,119382,105312,110711
1,2019,ASIA PACIFIC,BHUTAN,60,30,47,38.0,31,31,46,67,43,32,56,60
2,2019,ASIA PACIFIC,BANGLADESH,2262,2094,2489,2264.0,1938,4265,2656,2307,2035,2371,2164,2671
3,2019,ASIA PACIFIC,FIJI,91,73,72,77.0,42,62,2656,80,68,78,89,189
4,2019,ASIA PACIFIC,HONGKONG,1313,1367,764,6.0,1,5,2,1,0,11,0,45
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
357,2018,MIDDLE EAST,TURKEY,899,615,750,960.0,712,909,1306,1630,979,707,514,521
358,2018,MIDDLE EAST,UNITED ARAB EMIRATES,170,132,266,264.0,111,293,375,306,164,151,147,201
359,2018,MIDDLE EAST,YAMAN,98,49,76,55.0,23,62,40,52,67,37,60,85
360,2018,MIDDLE EAST,JORDAN,225,153,236,352.0,150,260,389,448,283,255,218,254
361,2018,OTHER NATIONALITIES,OTHER NATIONALITIES,6952,1704,1771,2484.0,2167,3711,2054,1269,1762,2604,3298,673

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 362 entries, 0 to 361
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       362 non-null    int64
 1   area       362 non-null    object
 2   country    362 non-null    object
 3   January    362 non-null    int64
 4   February   362 non-null    int64
 5   March      362 non-null    int64
 6   April      360 non-null    float64
 7   May        362 non-null    int64
 8   June       362 non-null    int64
 9   July       362 non-null    int64
 10  August     362 non-null    int64
 11  September  362 non-null    int64
 12  October    362 non-null    int64
 13  November   362 non-null    int64
 14  December   362 non-null    int64
dtypes: float64(1), int64(12), object(2)
memory usage: 42.6+ KB

Nomor 1

In [17]:
data_2018 = data.loc[data["year"] == 2018]
data_2019 = data.loc[data["year"] == 2019]

sum_2018 = data_2018.loc[0:, "January" : "December"].sum().sum()
sum_2019 = data_2019.loc[0:, "January" : "December"].sum().sum()

print(sum_2018)
print(sum_2019)

6073353.0
6275045.0

Nomor 2

In [18]:
mean_2018 = data_2018.loc[0:, "January" : "December"].sum().mean()
mean_2019 = data_2019.loc[0:, "January" : "December"].sum().mean()

print(mean_2018)
print(mean_2019)

506112.75
522920.4166666667

Nomor 3

In [19]:
idmax_2018 = data_2018.loc[0:, "January" : "December"].sum().idxmax()
idmax_2019 = data_2019.loc[0:, "January" : "December"].sum().idxmax()

print(idmax_2018)
print(idmax_2019)

July
August

Nomor 4

In [20]:
idmin_2018 = data_2018.loc[0:, "January" : "December"].sum().idxmin()
idmin_2019 = data_2019.loc[0:, "January" : "December"].sum().idxmin()

print(idmin_2018)
print(idmin_2019)

January
February

Nomor 5

In [21]:
kolom = data_2018.loc[0:, "January" : "December"].columns

area_2018 = data_2018.groupby("area")[kolom].sum().idxmax()
area_2019 = data_2019.groupby("area")[kolom].sum().idxmax()

print(area_2018)
print(area_2019)

January      ASIA PACIFIC
February     ASIA PACIFIC
March        ASIA PACIFIC
April        ASIA PACIFIC
May          ASIA PACIFIC
June         ASIA PACIFIC
July         ASIA PACIFIC
August       ASIA PACIFIC
September    ASIA PACIFIC
October      ASIA PACIFIC
November     ASIA PACIFIC
December     ASIA PACIFIC
dtype: object
January      ASIA PACIFIC
February     ASIA PACIFIC
March        ASIA PACIFIC
April        ASIA PACIFIC
May          ASIA PACIFIC
June         ASIA PACIFIC
July         ASIA PACIFIC
August       ASIA PACIFIC
September    ASIA PACIFIC
October      ASIA PACIFIC
November     ASIA PACIFIC
December     ASIA PACIFIC
dtype: object

Nomor 6

In [22]:
jumlah_2018 = data_2018.loc[0:, "January" : "December"].sum()
jumlah_2019 = data_2019.loc[0:, "January" : "December"].sum()

data = {
    "year" : [2018, 2019]
}

for i in range(len(kolom)):
    data.update({kolom[i] : [jumlah_2018.iloc[i], jumlah_2019.iloc[i]]})

df = pd.DataFrame(data)

df["max"] = [idmax_2018, idmax_2019]
df["min"] = [idmin_2018, idmin_2019]

df["Total"] = [sum_2018, sum_2019]
df["Rata"] = [mean_2018, mean_2019]

df.set_index("year", inplace=True)

df

,January,February,March,April,May,June,July,August,September,October,November,December,max,min,Total,Rata
year,,,,,,,,,,,,,,,,
2018,358065.0,452423.0,492678.0,516777.0,528512.0,544550.0,624366.0,573766.0,555903.0,517889.0,407213.0,501211.0,July,January,6073353.0,506112.750000
2019,456218.0,437537.0,449637.0,476327.0,485634.0,549751.0,594279.0,616706.0,590565.0,568064.0,497925.0,552402.0,August,February,6275045.0,522920.416667